; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v10 ?v4)
             (pred_4 ?v13 ?v2)
             (pred_6 ?v10 ?v2)
             (pred_7 ?v5 ?v10 )
	     (pred_12 ?v10)
             (pred_10 ?v12)
             (pred_3 ?v13)
             (pred_9 ?v2)
             (pred_11 ?v10)
             (pred_5 ?v13)
             (pred_1 ?v10)
             (pred_8 ))



(:action op_1
:parameters (?v1 ?v11 ?v8 ?v3)
:precondition (and (pred_10 ?v1) (pred_10 ?v11) (pred_3 ?v8) (pred_9 ?v3)
          (pred_2 ?v1 ?v11) (pred_4 ?v8 ?v3)
                   (pred_6 ?v11 ?v3) (pred_12 ?v1) 
                   (pred_11 ?v11) (pred_5 ?v8))
:effect (and  (pred_1 ?v11) (not (pred_11 ?v11))))


(:action op_4
:parameters (?v1 ?v7)
:precondition (and (pred_10 ?v1) (pred_10 ?v7)
               (pred_12 ?v1) (pred_2 ?v1 ?v7) (pred_1 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v1))))

(:action op_3
:parameters (?v1 ?v8)
:precondition (and (pred_10 ?v1) (pred_3 ?v8) 
                  (pred_12 ?v1) (pred_7 ?v8 ?v1) (pred_8 ))
:effect (and (pred_5 ?v8)
   (not (pred_7 ?v8 ?v1)) (not (pred_8 ))))


(:action op_2
:parameters (?v1 ?v9 ?v6)
:precondition (and (pred_10 ?v1) (pred_3 ?v9) (pred_3 ?v6)
                  (pred_12 ?v1) (pred_5 ?v6) (pred_7 ?v9 ?v1))
:effect (and (pred_5 ?v9) (pred_7 ?v6 ?v1)
        (not (pred_5 ?v6)) (not (pred_7 ?v9 ?v1))))

(:action op_5
:parameters (?v1 ?v8)
:precondition (and (pred_10 ?v1) (pred_3 ?v8) 
                  (pred_12 ?v1) (pred_5 ?v8))
:effect (and (pred_8 ) (pred_7 ?v8 ?v1) (not (pred_5 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_13 obj_15 obj_05 obj_08 obj_20 obj_10 obj_18 obj_07 obj_14 obj_03 obj_19 obj_06 obj_21 obj_09 obj_17
    obj_11 obj_02
    obj_04 obj_12 obj_16
    )

    (:init
       (pred_8)

       (pred_10 obj_01)
       (pred_10 obj_13)
       (pred_10 obj_15)
       (pred_10 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_20)
       (pred_10 obj_10)
       (pred_10 obj_18)
       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_03)
       (pred_10 obj_19)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_09)
       (pred_10 obj_17)
       (pred_9 obj_11)
       (pred_9 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_12)
       (pred_3 obj_16)

       (pred_2 obj_01 obj_08)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_13 obj_20)
       (pred_2 obj_13 obj_15)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_15 obj_05)
       (pred_2 obj_15 obj_13)
       (pred_2 obj_05 obj_18)
       (pred_2 obj_05 obj_15)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_08 obj_20)
       (pred_2 obj_08 obj_01)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_10)
       (pred_2 obj_20 obj_13)
       (pred_2 obj_20 obj_08)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_10 obj_18)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_10 obj_20)
       (pred_2 obj_18 obj_19)
       (pred_2 obj_18 obj_05)
       (pred_2 obj_18 obj_10)
       (pred_2 obj_07 obj_06)
       (pred_2 obj_07 obj_14)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_14 obj_21)
       (pred_2 obj_14 obj_03)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_14 obj_07)
       (pred_2 obj_03 obj_09)
       (pred_2 obj_03 obj_19)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_14)
       (pred_2 obj_19 obj_17)
       (pred_2 obj_19 obj_18)
       (pred_2 obj_19 obj_03)
       (pred_2 obj_06 obj_21)
       (pred_2 obj_06 obj_07)
       (pred_2 obj_21 obj_09)
       (pred_2 obj_21 obj_14)
       (pred_2 obj_21 obj_06)
       (pred_2 obj_09 obj_17)
       (pred_2 obj_09 obj_03)
       (pred_2 obj_09 obj_21)
       (pred_2 obj_17 obj_19)
       (pred_2 obj_17 obj_09)
       (pred_11 obj_18)
       (pred_11 obj_03)
       (pred_11 obj_09)
       (pred_6  obj_18 obj_11)
       (pred_6  obj_03 obj_02)
       (pred_6  obj_09 obj_02)
       (pred_1 obj_01)
       (pred_1 obj_13)
       (pred_1 obj_15)
       (pred_1 obj_05)
       (pred_1 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_10)
       (pred_1 obj_07)
       (pred_1 obj_14)
       (pred_1 obj_19)
       (pred_1 obj_06)
       (pred_1 obj_21)
       (pred_1 obj_17)

       (pred_4  obj_04 obj_11)
       (pred_4  obj_12 obj_02)
       (pred_4  obj_16 obj_02)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_12 obj_03)
       (pred_7 obj_16 obj_06)
       (pred_12 obj_15)
    )

    (:goal (and
       (pred_7 obj_16 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_07)))
)
)

; plan
1. (op_4 obj_15 obj_13)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_13)
   goals met: 0 of 1
2. (op_4 obj_13 obj_20)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_20)
   goals met: 0 of 1
3. (op_4 obj_20 obj_14)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_14)
   goals met: 0 of 1
4. (op_4 obj_14 obj_21)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_21)
   goals met: 0 of 1
5. (op_4 obj_21 obj_06)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_06)
   goals met: 0 of 1
6. (op_3 obj_06 obj_16)
   deleted: (pred_7 obj_16 obj_06) (pred_8)
   added: (pred_5 obj_16)
   goals met: 0 of 1
7. (op_4 obj_06 obj_21)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_21)
   goals met: 0 of 1
8. (op_4 obj_21 obj_14)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_14)
   goals met: 0 of 1
9. (op_4 obj_14 obj_20)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_20)
   goals met: 0 of 1
10. (op_4 obj_20 obj_13)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_13)
   goals met: 0 of 1
11. (op_4 obj_13 obj_15)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_15)
   goals met: 0 of 1
12. (op_4 obj_15 obj_05)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_05)
   goals met: 0 of 1
13. (op_5 obj_05 obj_16)
   deleted: (pred_5 obj_16)
   added: (pred_8) (pred_7 obj_16 obj_05)
   goals met: 1 of 1
